Ran Plan for 2 projects:

1. project: `cvm` dir: `cvm` workspace: `default`
1. project: `clb` dir: `clb` workspace: `default`
---

### 1. project: `cvm` dir: `cvm` workspace: `default`
<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDwxPWpE1p10fIwmBrpr7S4IyK2Hq24NE5L9hoRv_YNcyKgF8IVwnbkQSojUc5js1Q
TENCENTCLOUD_SECRET_KEY=itOWsfKQqlob/8xthK4kMl0uk6cSmpJrnwX1L3qO46M=
TENCENTCLOUD_SECURITY_TOKEN=bKDpgeyK3k25XJNkPUs0cwYWryQ92M5a7ab66c72d079a1fcc49d30bd546ae1advfhM-AyXOopZtA5a7bH_XAyC8z4wKlrMxXK4PZv0MPMBwgD1Cj1YvtvBynZNs0JBCqtn-OiSr7znIPc9MK5IYurLFHOq_eDNdrxc85b7BrREzQNI2H6EHKYa-FkLhnxWWOssGegWD5DVNTQj5nQDMYIyHzazzvcgP3WPsddsq51kUXjpOfAecnikfSQ4mYLjLmh0Etyq5NsnUOzlM_mI2b6llIbJppJCAyZiYThhxTVuGtOaFO0FBmENx4IsuxQOAoAPTiAUQSY4T_JkBQZEGrnhmjU3D0Z6v4RquQH6vW-T83ZrfrWMj19vCiahi2bG

Initializing the backend...

Initializing provider plugins...
- Finding latest version of tencentcloudstack/tencentcloud...
- Installing tencentcloudstack/tencentcloud v1.81.110...
- Installed tencentcloudstack/tencentcloud v1.81.110 (signed by a HashiCorp partner, key ID 84F69E1C1BECF459)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Fetching temporary credentials...
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDwxPWpE1p10fIwmBrpr7S4IyK2Hq24NE5L9hoRv_YNcyKgF8IVwnbkQSojUc5js1Q
TENCENTCLOUD_SECRET_KEY=itOWsfKQqlob/8xthK4kMl0uk6cSmpJrnwX1L3qO46M=
TENCENTCLOUD_SECURITY_TOKEN=bKDpgeyK3k25XJNkPUs0cwYWryQ92M5a7ab66c72d079a1fcc49d30bd546ae1advfhM-AyXOopZtA5a7bH_XAyC8z4wKlrMxXK4PZv0MPMBwgD1Cj1YvtvBynZNs0JBCqtn-OiSr7znIPc9MK5IYurLFHOq_eDNdrxc85b7BrREzQNI2H6EHKYa-FkLhnxWWOssGegWD5DVNTQj5nQDMYIyHzazzvcgP3WPsddsq51kUXjpOfAecnikfSQ4mYLjLmh0Etyq5NsnUOzlM_mI2b6llIbJppJCAyZiYThhxTVuGtOaFO0FBmENx4IsuxQOAoAPTiAUQSY4T_JkBQZEGrnhmjU3D0Z6v4RquQH6vW-T83ZrfrWMj19vCiahi2bG

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.cvm_cicd_kk_1 will be created
  + resource "tencentcloud_instance" "cvm_cicd_kk_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + hostname                                = "user"
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cvm_cicd_kk_1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = (known after apply)
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)

      + data_disks {
          + data_disk_id           = (known after apply)
          + data_disk_size         = 50
          + data_disk_type         = "CLOUD_PREMIUM"
          + delete_with_instance   = true
          + encrypt                = false
          + throughput_performance = 0
        }
    }

  # tencentcloud_subnet.cicd_kk will be created
  + resource "tencentcloud_subnet" "cicd_kk" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.1.0/24"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd_kk_subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_kk will be created
  + resource "tencentcloud_vpc" "cicd_kk" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd_kk_vpc"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + instance_id = (known after apply)
  + public_ip   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p cvm
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http:/lock?id=yakir-Yang%252Fterraform-demo-with-cam-sts%252Fcvm%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p cvm
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. project: `clb` dir: `clb` workspace: `default`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #8. To continue, delete the lock from #8 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```